#include <string>
#include <iostream>

// 第一反应有限状态机？
// -----------------------------------------------------------------
//           输入       不同的字符                  有相同的字符
// -----------------------------------------------------------------
// 状态
// -----------------------------------------------------------------
// 不同的字符           位数加一                    提取位数并且下一个为开头数
// -----------------------------------------------------------------
// 开头数               位数归零                    length = 0

int lengthOfLongestSubstring(std::string s)
{
    auto t = s.begin();
    auto sc = s.size();
}